## Production: elasticache
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elasticache_cluster.notification-cluster-cache-multiaz-group-replica will be created
  + resource "aws_elasticache_cluster" "notification-cluster-cache-multiaz-group-replica" {
      + apply_immediately      = (known after apply)
      + arn                    = (known after apply)
      + availability_zone      = (known after apply)
      + az_mode                = (known after apply)
      + cache_nodes            = (known after apply)
      + cluster_address        = (known after apply)
      + cluster_id             = "notification-canada-ca-production-cluster-cache-az"
      + configuration_endpoint = (known after apply)
      + engine                 = (known after apply)
      + engine_version         = (known after apply)
      + engine_version_actual  = (known after apply)
      + id                     = (known after apply)
      + maintenance_window     = (known after apply)
      + node_type              = (known after apply)
      + num_cache_nodes        = (known after apply)
      + parameter_group_name   = (known after apply)
      + port                   = (known after apply)
      + replication_group_id   = (known after apply)
      + security_group_ids     = (known after apply)
      + security_group_names   = (known after apply)
      + snapshot_window        = (known after apply)
      + subnet_group_name      = (known after apply)
      + tags_all               = (known after apply)
    }

  # aws_elasticache_replication_group.notification-cluster-cache-multiaz-group will be created
  + resource "aws_elasticache_replication_group" "notification-cluster-cache-multiaz-group" {
      + apply_immediately              = true
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auto_minor_version_upgrade     = true
      + automatic_failover_enabled     = true
      + availability_zones             = [
          + "ca-central-1a",
          + "ca-central-1b",
          + "ca-central-1d",
        ]
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + engine                         = "redis"
      + engine_version                 = "6.x"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + maintenance_window             = "thu:04:00-thu:05:00"
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + node_type                      = "cache.t3.micro"
      + number_cache_clusters          = 3
      + parameter_group_name           = "default.redis6.x"
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replication_group_description  = "Redis multiaz cluster with replication group"
      + replication_group_id           = "notify-production-cluster-cache-az"
      + security_group_ids             = [
          + "sg-09e3175f46bc85607",
        ]
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "notification-canada-ca-production-cache-subnet"
      + tags                           = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all                       = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + transit_encryption_enabled     = (known after apply)

      + cluster_mode {
          + num_node_groups         = (known after apply)
          + replicas_per_node_group = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_cluster.notification-cluster-cache"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_cluster.notification-cluster-cache-multiaz-group-replica"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_replication_group.notification-cluster-cache-multiaz-group"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.notification-canada-ca-cache-subnet"]

25 tests, 17 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
